; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_8_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 - counter
	)
  (:init
		(= (value c0) 84)
	(= (value c1) 64)
	(= (value c2) 12)
	(= (value c3) 43)
	(= (value c4) 76)
	(= (value c5) 50)
	(= (value c6) 80)
	(= (value c7) 94)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
		)
	)
)

; plan
1. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 4 of 7
2. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 4 of 7
3. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 4 of 7
4. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 4 of 7
5. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 4 of 7
6. (increase_rate c2)
   changed: (rate_value c2) from 5 to 6
   goals met: 4 of 7
7. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 4 of 7
8. (increase_rate c2)
   changed: (rate_value c2) from 6 to 7
   goals met: 4 of 7
9. (increment c2)
   changed: (value c2) from 12 to 19
   goals met: 4 of 7
10. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 4 of 7
11. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 4 of 7
12. (increase_rate c2)
   changed: (rate_value c2) from 7 to 8
   goals met: 4 of 7
13. (increment c2)
   changed: (value c2) from 19 to 27
   goals met: 4 of 7
14. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 4 of 7
15. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 4 of 7
16. (increase_rate c2)
   changed: (rate_value c2) from 8 to 9
   goals met: 4 of 7
17. (increment c2)
   changed: (value c2) from 27 to 36
   goals met: 4 of 7
18. (increase_rate c2)
   changed: (rate_value c2) from 9 to 10
   goals met: 4 of 7
19. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 4 of 7
20. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 4 of 7
21. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 4 of 7
22. (decrement c0)
   changed: (value c0) from 84 to 81
   goals met: 4 of 7
23. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 4 of 7
24. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 4 of 7
25. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 4 of 7
26. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 4 of 7
27. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 4 of 7
28. (increment c5)
   changed: (value c5) from 50 to 55
   goals met: 4 of 7
29. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 4 of 7
30. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 4 of 7
31. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 4 of 7
32. (increment c5)
   changed: (value c5) from 55 to 61
   goals met: 4 of 7
33. (increase_rate c5)
   changed: (rate_value c5) from 6 to 7
   goals met: 4 of 7
34. (increment c5)
   changed: (value c5) from 61 to 68
   goals met: 4 of 7
35. (increment c5)
   changed: (value c5) from 68 to 75
   goals met: 4 of 7
36. (decrement c4)
   changed: (value c4) from 76 to 74
   goals met: 5 of 7
37. (increment c2)
   changed: (value c2) from 36 to 46
   goals met: 4 of 7
38. (increment c1)
   changed: (value c1) from 64 to 69
   goals met: 4 of 7
39. (increment c1)
   changed: (value c1) from 69 to 74
   goals met: 4 of 7
40. (decrement c0)
   changed: (value c0) from 81 to 78
   goals met: 4 of 7
41. (decrement c0)
   changed: (value c0) from 78 to 75
   goals met: 4 of 7
42. (decrement c0)
   changed: (value c0) from 75 to 72
   goals met: 5 of 7
43. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 5 of 7
44. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 5 of 7
45. (increase_rate c1)
   changed: (rate_value c1) from 7 to 8
   goals met: 5 of 7
46. (increase_rate c1)
   changed: (rate_value c1) from 8 to 9
   goals met: 5 of 7
47. (increase_rate c1)
   changed: (rate_value c1) from 9 to 10
   goals met: 5 of 7
48. (decrement c1)
   changed: (value c1) from 74 to 64
   goals met: 4 of 7
49. (decrement c0)
   changed: (value c0) from 72 to 69
   goals met: 4 of 7
50. (decrement c0)
   changed: (value c0) from 69 to 66
   goals met: 4 of 7
51. (decrement c0)
   changed: (value c0) from 66 to 63
   goals met: 5 of 7
52. (increment c2)
   changed: (value c2) from 46 to 56
   goals met: 5 of 7
53. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 5 of 7
54. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 5 of 7
55. (increment c3)
   changed: (value c3) from 43 to 45
   goals met: 5 of 7
56. (increment c3)
   changed: (value c3) from 45 to 47
   goals met: 5 of 7
57. (decrement c2)
   changed: (value c2) from 56 to 46
   goals met: 6 of 7
58. (decrement c1)
   changed: (value c1) from 64 to 54
   goals met: 5 of 7
59. (decrement c1)
   changed: (value c1) from 54 to 44
   goals met: 6 of 7
60. (increase_rate c0)
   changed: (rate_value c0) from 3 to 4
   goals met: 6 of 7
61. (increase_rate c0)
   changed: (rate_value c0) from 4 to 5
   goals met: 6 of 7
62. (decrement c0)
   changed: (value c0) from 63 to 58
   goals met: 6 of 7
63. (decrement c0)
   changed: (value c0) from 58 to 53
   goals met: 6 of 7
64. (decrement c0)
   changed: (value c0) from 53 to 48
   goals met: 6 of 7
65. (decrement c0)
   changed: (value c0) from 48 to 43
   goals met: 7 of 7
